armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32L4xx/Keil.STM32L4xx_DFP.pdsc
        <!-- *************************  Device 'STM32L412T8Yx'  ***************************** -->
        <device Dname="STM32L412T8Yx">
          <memory  name="Main_Flash" access="rx"  id="IROM1"     start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory  name="SRAM"       access="rwx" id="IRAM1"     start="0x20000000" size="0x00008000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_64.FLM"         start="0x08000000" size="0x00010000"            default="1"/>
          <feature type="CSP" n="36"/>
        </device>

        <!-- ################################### 128 KB ################################## -->
        <!-- *************************  Device 'STM32L412CBTx'  ***************************** -->
        <device Dname="STM32L412CBTx">
          <memory  name="Main_Flash" access="rx"  id="IROM1"     start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory  name="SRAM"       access="rwx" id="IRAM1"     start="0x20000000" size="0x00008000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_128.FLM"         start="0x08000000" size="0x00020000"            default="1"/>
          <feature type="QFP" n="48"/>
        </device>
        <!-- *************************  Device 'STM32L412CBUx'  ***************************** -->
        <device Dname="STM32L412CBUx">
          <memory  name="Main_Flash" access="rx"  id="IROM1"     start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory  name="SRAM"       access="rwx" id="IRAM1"     start="0x20000000" size="0x00008000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_128.FLM"         start="0x08000000" size="0x00020000"            default="1"/>
          <feature type="QFN" n="48"/>
        </device>
        <!-- *************************  Device 'STM32L412KBTx'  ***************************** -->
        <device Dname="STM32L412KBTx">
          <memory  name="Main_Flash" access="rx"  id="IROM1"     start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory  name="SRAM"       access="rwx" id="IRAM1"     start="0x20000000" size="0x00008000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_128.FLM"         start="0x08000000" size="0x00020000"            default="1"/>
          <feature type="QFP" n="32"/>
        </device>
        <!-- *************************  Device 'STM32L412KBUx'  ***************************** -->
        <device Dname="STM32L412KBUx">
          <memory  name="Main_Flash" access="rx"  id="IROM1"     start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory  name="SRAM"       access="rwx" id="IRAM1"     start="0x20000000" size="0x00008000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_128.FLM"         start="0x08000000" size="0x00020000"            default="1"/>
          <feature type="QFN" n="32"/>
        </device>
        <!-- *************************  Device 'STM32L412KBIx'  ***************************** -->
        <device Dname="STM32L412KBIx">
          <memory  name="Main_Flash" access="rx"  id="IROM1"     start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory  name="SRAM"       access="rwx" id="IRAM1"     start="0x20000000" size="0x00008000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_128.FLM"         start="0x08000000" size="0x00020000"            default="1"/>
          <feature type="BGA" n="64"/>
        </device>
        <!-- *************************  Device 'STM32L412TBYx'  ***************************** -->
        <device Dname="STM32L412TBYx">
          <memory  name="Main_Flash" access="rx"  id="IROM1"     start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory  name="SRAM"       access="rwx" id="IRAM1"     start="0x20000000" size="0x00008000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_128.FLM"         start="0x08000000" size="0x00020000"            default="1"/>
          <feature type="CSP" n="36"/>
        </device>
      </subFamily>
      <!-- ************************  Subfamily 'STM32L422'  **************************** -->
      <subFamily DsubFamily="STM32L422">
        <book name="Documentation/RM0394.pdf" title="STM32L41xxx STM32L42xxx STM32L43xxx STM32L44xxx STM32L45xxx STM32L46xxx Reference Manual"/>
        <book name="Documentation/DS12470.pdf" title="STM32L422xx Data Sheet"/>
        <debugvars configfile="CMSIS/Debug/STM32L41x_42x.dbgconf">
          __var DbgMCU_CR       = 0x00000007;   // DBGMCU_CR: DBG_SLEEP, DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz1 = 0x00000000;   // DGBMCU_APB1_FZ1: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB1_Fz2 = 0x00000000;   // DGBMCU_APB1_FZ2: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz  = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
          __var TraceClk_Pin    = 0x00040002;   // PE2
          __var TraceD0_Pin     = 0x00040003;   // PE3
          __var TraceD1_Pin     = 0x00040004;   // PE4
          __var TraceD2_Pin     = 0x00040005;   // PE5
          __var TraceD3_Pin     = 0x00040006;   // PE6
          __var DoOptionByteLoading = 0;        // Disabled
        </debugvars>
        <debug svd="CMSIS/SVD/STM32L412.svd"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32L4xx/Include/stm32l4xx.h"  define="STM32L422xx"/>
        <memory id="IRAM1"                                 start="0x20000000" size="0x00008000" init="0" default="1"/>
        <memory id="IRAM2"                                 start="0x10000000" size="0x00002000" init="0" default="0"/>
        <algorithm name="CMSIS/Flash/STM32L4xx_SB_OPT.FLM" start="0x1FFF7800" size="0x00000014"          default="0"/>

        <feature type="Timer"    n="10"   m="16"/>
        <feature type="Timer"    n="1"    m="32"/>
        <feature type="ADC"      n="1"    m="12"/>
        <feature type="DAC"      n="2"    m="12"/>
        <feature type="SPI"      n="3"/>
        <feature type="ComOther" n="2"                  name="SAI Interface"/>
        <feature type="I2C"      n="3"/>
        <feature type="USART"    n="4"    m="11250000"/>
        <feature type="USBD"     n="1"/>
        <feature type="CAN"      n="1"/>
        <feature type="VCC"      n="1.71" m="3.60"/>

