armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32L4xx/Keil.STM32L4xx_DFP.pdsc
        <!-- *************************  Device 'STM32L431CCYx'  ***************************** -->
        <device Dname="STM32L431CCYx">
          <memory name="Main_Flash" access="rx"  id="IROM1"       start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"       start="0x20000000" size="0x0000C000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_256.FLM"         start="0x08000000" size="0x00040000"             default="1"/>
          <feature type="CSP" n="48"/>
        </device>
        <!-- *************************  Device 'STM32L431KCUx'  ***************************** -->
        <device Dname="STM32L431KCUx">
          <memory name="Main_Flash" access="rx"  id="IROM1"       start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"       start="0x20000000" size="0x0000C000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_256.FLM"         start="0x08000000" size="0x00040000"             default="1"/>
          <feature type="QFN" n="32"/>
        </device>
        <!-- *************************  Device 'STM32L431RCTx'  ***************************** -->
        <device Dname="STM32L431RCTx">
          <memory name="Main_Flash" access="rx"  id="IROM1"       start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"       start="0x20000000" size="0x0000C000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_256.FLM"         start="0x08000000" size="0x00040000"             default="1"/>
          <feature type="QFP" n="64"/>
        </device>
        <!-- *************************  Device 'STM32L431RCYx'  ***************************** -->
        <device Dname="STM32L431RCYx">
          <memory name="Main_Flash" access="rx"  id="IROM1"       start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"       start="0x20000000" size="0x0000C000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_256.FLM"         start="0x08000000" size="0x00040000"             default="1"/>
          <feature type="CSP" n="64"/>
        </device>
        <!-- *************************  Device 'STM32L431RCIx'  ***************************** -->
        <device Dname="STM32L431RCIx">
          <memory name="Main_Flash" access="rx"  id="IROM1"       start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"       start="0x20000000" size="0x0000C000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_256.FLM"         start="0x08000000" size="0x00040000"             default="1"/>
          <feature type="BGA" n="64"/>
        </device>

        <!-- *************************  Device 'STM32L431VCTx'  ***************************** -->
        <device Dname="STM32L431VCTx">
          <memory name="Main_Flash" access="rx"  id="IROM1"       start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"       start="0x20000000" size="0x0000C000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_256.FLM"         start="0x08000000" size="0x00040000"             default="1"/>
          <feature type="QFP" n="100"/>
        </device>
        <!-- *************************  Device 'STM32L431VCIx'  ***************************** -->
        <device Dname="STM32L431VCIx">
          <memory name="Main_Flash" access="rx"  id="IROM1"       start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"       start="0x20000000" size="0x0000C000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_256.FLM"         start="0x08000000" size="0x00040000"             default="1"/>
          <feature type="BGA" n="100"/>
        </device>
        <!-- ################################### 128 KB ################################## -->
        <!-- *************************  Device 'STM32L431CBTx'  ***************************** -->
        <device Dname="STM32L431CBTx">
          <memory name="Main_Flash" access="rx"  id="IROM1"     start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"     start="0x20000000" size="0x0000C000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_128.FLM"       start="0x08000000" size="0x00020000"             default="1"/>
          <feature type="QFP" n="48"/>
        </device>
        <!-- *************************  Device 'STM32L431CBUx'  ***************************** -->
        <device Dname="STM32L431CBUx">
          <memory name="Main_Flash" access="rx"  id="IROM1"     start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"     start="0x20000000" size="0x0000C000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_128.FLM"       start="0x08000000" size="0x00020000"             default="1"/>
          <feature type="QFN" n="48"/>
        </device>
        <!-- *************************  Device 'STM32L431CBYx'  ***************************** -->
        <device Dname="STM32L431CBYx">
          <memory name="Main_Flash" access="rx"  id="IROM1"     start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"     start="0x20000000" size="0x0000C000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_128.FLM"       start="0x08000000" size="0x00020000"             default="1"/>
          <feature type="CSP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32L431KBUx'  ***************************** -->
        <device Dname="STM32L431KBUx">
          <memory name="Main_Flash" access="rx"  id="IROM1"     start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"     start="0x20000000" size="0x0000C000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_128.FLM"       start="0x08000000" size="0x00020000"             default="1"/>
          <feature type="QFN" n="32"/>
        </device>

        <!-- *************************  Device 'STM32L431RBTx'  ***************************** -->
        <device Dname="STM32L431RBTx">
          <memory name="Main_Flash" access="rx"  id="IROM1"     start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"     start="0x20000000" size="0x0000C000" init="0"    default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_128.FLM"       start="0x08000000" size="0x00020000"             default="1"/>
          <feature type="QFP" n="64"/>
        </device>
