armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32L4xx/Keil.STM32L4xx_DFP.pdsc
        <!-- ################################### 512 KB ################################## -->
        <!-- *************************  Device 'STM32L471RETx'  ***************************** -->
        <device Dname="STM32L471RETx">
          <memory name="Main_Flash" access="rx" id="IROM1"      start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"     start="0x20000000" size="0x00018000" init="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_512.FLM"       start="0x08000000" size="0x00080000"             default="1"/>
          <feature type="QFP" n="64"/>
        </device>
        <!-- *************************  Device 'STM32L471JEYx'  ***************************** -->
        <device Dname="STM32L471JEYx">
          <memory name="Main_Flash" access="rx" id="IROM1"      start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"     start="0x20000000" size="0x00018000" init="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_512.FLM"       start="0x08000000" size="0x00080000"             default="1"/>
          <feature type="CSP" n="72"/>
        </device>
        <!-- *************************  Device 'STM32L471VETx'  ***************************** -->
        <device Dname="STM32L471VETx">
          <memory name="Main_Flash" access="rx" id="IROM1"      start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"     start="0x20000000" size="0x00018000" init="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_512.FLM"       start="0x08000000" size="0x00080000"             default="1"/>
          <feature type="QFP" n="100"/>
        </device>
        <!-- *************************  Device 'STM32L471QEIx'  ***************************** -->
        <device Dname="STM32L471QEIx">
          <memory name="Main_Flash" access="rx" id="IROM1"      start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"     start="0x20000000" size="0x00018000" init="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_512.FLM"       start="0x08000000" size="0x00080000"             default="1"/>
          <feature type="BGA" n="132"/>
        </device>
        <!-- *************************  Device 'STM32L471ZETx'  ***************************** -->
        <device Dname="STM32L471ZETx">
          <memory name="Main_Flash" access="rx" id="IROM1"      start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"     start="0x20000000" size="0x00018000" init="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_512.FLM"       start="0x08000000" size="0x00080000"             default="1"/>
          <feature type="QFP" n="144"/>
        </device>
        <!-- ################################### 1 MB ################################## -->
        <!-- *************************  Device 'STM32L471RGTx'  ***************************** -->
        <device Dname="STM32L471RGTx">
          <memory name="Main_Flash" access="rx"  id="IROM1"     start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"     start="0x20000000" size="0x00018000" init="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM"      start="0x08000000" size="0x00100000"             default="1"/>
          <feature type="QFP" n="64"/>
        </device>
        <!-- *************************  Device 'STM32L471RGYx'  ***************************** -->
        <device Dname="STM32L471RGYx">
          <memory name="Main_Flash" access="rx"  id="IROM1"     start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"     start="0x20000000" size="0x00018000" init="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM"      start="0x08000000" size="0x00100000"             default="1"/>
          <feature type="CSP" n="64"/>
        </device>

        <!-- *************************  Device 'STM32L471JGYx'  ***************************** -->
        <device Dname="STM32L471JGYx">
          <memory name="Main_Flash" access="rx"  id="IROM1"     start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"     start="0x20000000" size="0x00018000" init="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM"      start="0x08000000" size="0x00100000"             default="1"/>
          <feature type="CSP" n="72"/>
        </device>

        <!-- *************************  Device 'STM32L471VGTx'  ***************************** -->
        <device Dname="STM32L471VGTx">
          <memory name="Main_Flash" access="rx"  id="IROM1"     start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"     start="0x20000000" size="0x00018000" init="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM"      start="0x08000000" size="0x00100000"             default="1"/>
          <feature type="QFP" n="100"/>
        </device>

        <!-- *************************  Device 'STM32L471QGIx'  ***************************** -->
        <device Dname="STM32L471QGIx">
          <memory name="Main_Flash" access="rx"  id="IROM1"     start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"     start="0x20000000" size="0x00018000" init="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM"      start="0x08000000" size="0x00100000"             default="1"/>
          <feature type="BGA" n="132"/>
        </device>

        <!-- *************************  Device 'STM32L471ZGTx'  ***************************** -->
        <device Dname="STM32L471ZGTx">
          <memory name="Main_Flash" access="rx"  id="IROM1"     start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"     start="0x20000000" size="0x00018000" init="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM"      start="0x08000000" size="0x00100000"             default="1"/>
          <feature type="QFP" n="144"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32L475'  **************************** -->
      <subFamily DsubFamily="STM32L475">
        <compile header="Drivers/CMSIS/Device/ST/STM32L4xx/Include/stm32l4xx.h"  define="STM32L475xx"/>
        <debug svd="CMSIS/SVD/STM32L4x5.svd"/>

