armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32L4xx/Keil.STM32L4xx_DFP.pdsc
        <debugvars configfile="CMSIS/Debug/STM32L4x5_4x6.dbgconf">
          __var DbgMCU_CR       = 0x00000007;   // DBGMCU_CR: DBG_SLEEP, DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz1 = 0x00000000;   // DGBMCU_APB1_FZ1: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB1_Fz2 = 0x00000000;   // DGBMCU_APB1_FZ2: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz  = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
          __var TraceClk_Pin    = 0x00040002;   // PE2
          __var TraceD0_Pin     = 0x00040003;   // PE3
          __var TraceD1_Pin     = 0x00040004;   // PE4
          __var TraceD2_Pin     = 0x00040005;   // PE5
          __var TraceD3_Pin     = 0x00040006;   // PE6
          __var DoOptionByteLoading = 0;        // Disabled
        </debugvars>

        <memory id="IRAM1"                                 start="0x20000000" size="0x00018000" init="0" default="1"/>
        <memory id="IRAM2"                                 start="0x10000000" size="0x00008000" init="0" default="0"/>
        <algorithm name="CMSIS/Flash/STM32L4xx_DB_OPT.FLM" start="0x1FFF7800" size="0x00000014"          default="0"/>

        <book name="Documentation/DM00083560.pdf" title="STM32L4x5 STM32L4x6 Reference Manual"/>
        <book name="Documentation/DM00172872.pdf" title="STM32L475xx Data Sheet"/>

        <feature type="Timer"    n="14"   m="16"/>
        <feature type="Timer"    n="2"    m="32"/>
        <feature type="ADC"      n="2"    m="12"/>
        <feature type="DAC"      n="2"    m="12"/>
        <feature type="SPI"      n="3"/>
        <feature type="ComOther" n="2"               name="SAI Interface"/>
        <feature type="I2C"      n="3"/>
        <feature type="USART"    n="6"    m="11250000"/>
        <feature type="USBOTG"   n="2"/>
        <feature type="CAN"      n="1"/>
        <feature type="VCC"      n="1.80" m="3.60"/>
        <!-- ################################### 256 KB ################################## -->
        <!-- *************************  Device 'STM32L475RCTx'  ***************************** -->
        <device Dname="STM32L475RCTx">
          <memory name="Main_Flash" access="rx" id="IROM1"    start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"   start="0x20000000" size="0x00018000" init="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_256.FLM"     start="0x08000000" size="0x00040000"             default="1"/>

          <feature type="QFP" n="64"/>
        </device>

        <!-- *************************  Device 'STM32L475VCTx'  ***************************** -->
        <device Dname="STM32L475VCTx">
          <memory name="Main_Flash" access="rx" id="IROM1"    start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"   start="0x20000000" size="0x00018000" init="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_256.FLM"     start="0x08000000" size="0x00040000"             default="1"/>
          <feature type="QFP" n="100"/>
        </device>
        <!-- ################################### 512 KB ################################## -->
        <!-- *************************  Device 'STM32L475RETx'  ***************************** -->
        <device Dname="STM32L475RETx">
          <memory id="IROM1"                              start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_512.FLM" start="0x08000000" size="0x00080000"             default="1"/>
          <feature type="QFP" n="64"/>
        </device>

        <!-- *************************  Device 'STM32L475JEYx'  ***************************** -->
        <device Dname="STM32L475JEYx">
          <memory name="Main_Flash" access="rx"  id="IROM1"   start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"   start="0x20000000" size="0x00018000" init="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_512.FLM"     start="0x08000000" size="0x00080000"             default="1"/>
          <feature type="CSP" n="72"/>
        </device>

        <!-- *************************  Device 'STM32L475VETx'  ***************************** -->
        <device Dname="STM32L475VETx">
          <memory name="Main_Flash" access="rx"  id="IROM1"   start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"   start="0x20000000" size="0x00018000" init="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_512.FLM"     start="0x08000000" size="0x00080000"             default="1"/>
          <feature type="QFP" n="100"/>
        </device>

        <!-- *************************  Device 'STM32L475QEIx'  ***************************** -->
        <device Dname="STM32L475QEIx">
          <memory name="Main_Flash" access="rx"  id="IROM1"   start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"   start="0x20000000" size="0x00018000" init="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_512.FLM"     start="0x08000000" size="0x00080000"             default="1"/>
          <feature type="BGA" n="132"/>
        </device>

        <!-- *************************  Device 'STM32L475ZETx'  ***************************** -->
        <device Dname="STM32L475ZETx">
          <memory name="Main_Flash" access="rx"  id="IROM1"   start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"   start="0x20000000" size="0x00018000" init="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_512.FLM"     start="0x08000000" size="0x00080000"             default="1"/>

          <feature type="QFP" n="144"/>
        </device>
        <!-- ################################### 1 MB ################################## -->
        <!-- *************************  Device 'STM32L475RGTx'  ***************************** -->
        <device Dname="STM32L475RGTx">
          <memory name="Main_Flash" access="rx"   id="IROM1"   start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"   start="0x20000000" size="0x00018000" init="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM"    start="0x08000000" size="0x00100000"             default="1"/>

          <feature type="QFP" n="64"/>
        </device>

