armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32L4xx/Keil.STM32L4xx_DFP.pdsc
        <!-- *************************  Device 'STM32L476JEYx'  ***************************** -->
        <device Dname="STM32L476JEYx">
          <memory name="Main_Flash" access="rx"  id="IROM1"   start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"   start="0x20000000" size="0x00018000" init="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_512.FLM" start="0x08000000" size="0x00080000"             default="1"/>

          <feature type="CSP" n="72"/>
        </device>

        <!-- *************************  Device 'STM32L476MEYx'  ***************************** -->
        <device Dname="STM32L476MEYx">
          <memory name="Main_Flash" access="rx"  id="IROM1"   start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"   start="0x20000000" size="0x00018000" init="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_512.FLM" start="0x08000000" size="0x00080000"             default="1"/>
          <feature type="CSP" n="81"/>
        </device>

        <!-- *************************  Device 'STM32L476VETx'  ***************************** -->
        <device Dname="STM32L476VETx">
          <memory name="Main_Flash" access="rx"  id="IROM1"   start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"   start="0x20000000" size="0x00018000" init="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_512.FLM" start="0x08000000" size="0x00080000"             default="1"/>

          <feature type="QFP" n="100"/>
        </device>

        <!-- *************************  Device 'STM32L476QEIx'  ***************************** -->
        <device Dname="STM32L476QEIx">
          <memory name="Main_Flash" access="rx"  id="IROM1"   start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"   start="0x20000000" size="0x00018000" init="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_512.FLM" start="0x08000000" size="0x00080000"             default="1"/>

          <feature type="BGA" n="132"/>
        </device>

        <!-- *************************  Device 'STM32L476ZETx'  ***************************** -->
        <device Dname="STM32L476ZETx">
          <memory name="Main_Flash" access="rx"  id="IROM1"   start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"   start="0x20000000" size="0x00018000" init="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_512.FLM" start="0x08000000" size="0x00080000"             default="1"/>

          <feature type="QFP" n="144"/>
        </device>
        <!-- ################################### 1 MB ################################## -->
        <!-- *************************  Device 'STM32L476RGTx'  ***************************** -->
        <device Dname="STM32L476RGTx">
          <memory name="Main_Flash" access="rx"  id="IROM1"   start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"   start="0x20000000" size="0x00018000" init="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM"   start="0x08000000" size="0x00100000"             default="1"/>

          <feature type="QFP" n="64"/>
        </device>

        <!-- *************************  Device 'STM32L476ZGTx'  ***************************** -->
        <device Dname="STM32L476ZGTx">
          <memory name="Main_Flash" access="rx"  id="IROM1"   start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"   start="0x20000000" size="0x00018000" init="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM"   start="0x08000000" size="0x00100000"             default="1"/>
          <feature type="QFP" n="144"/>
        </device>

        <!-- *************************  Device 'STM32L476JGYx'  ***************************** -->
        <device Dname="STM32L476JGYx">
          <memory name="Main_Flash" access="rx"  id="IROM1"   start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"   start="0x20000000" size="0x00018000" init="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM"   start="0x08000000" size="0x00100000"             default="1"/>
          <feature type="CSP" n="72"/>
        </device>
        <!-- *************************  Device 'STM32L476MGYx'  ***************************** -->
        <device Dname="STM32L476MGYx">
          <memory name="Main_Flash" access="rx"  id="IROM1"   start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"   start="0x20000000" size="0x00018000" init="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM"   start="0x08000000" size="0x00100000"             default="1"/>
          <feature type="CSP" n="81"/>
        </device>
        <!-- *************************  Device 'STM32L476VGTx'  ***************************** -->
        <device Dname="STM32L476VGTx">
          <memory name="Main_Flash" access="rx"  id="IROM1"   start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"   start="0x20000000" size="0x00018000" init="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM"   start="0x08000000" size="0x00100000"             default="1"/>
          <feature type="QFP" n="100"/>
        </device>
        <!-- *************************  Device 'STM32L476QGIx'  ***************************** -->
        <device Dname="STM32L476QGIx">
          <memory name="Main_Flash" access="rx"  id="IROM1"   start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"   start="0x20000000" size="0x00018000" init="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM"   start="0x08000000" size="0x00100000"             default="1"/>
          <feature type="BGA" n="132"/>
        </device>
      </subFamily>

