armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32L4xx/Keil.STM32L4xx_DFP.pdsc
        <!-- *************************  Device 'STM32L486VGTx'  ***************************** -->
        <device Dname="STM32L486VGTx">
          <memory name="Main_Flash" access="rx"  id="IROM1"  start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00018000" init="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM" start="0x08000000" size="0x00100000"             default="1"/>

          <feature type="QFP" n="100"/>
        </device>

        <!-- *************************  Device 'STM32L486QGIx'  ***************************** -->
        <device Dname="STM32L486QGIx">
          <memory name="Main_Flash" access="rx"  id="IROM1"  start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00018000" init="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM" start="0x08000000" size="0x00100000"             default="1"/>

          <feature type="BGA" n="132"/>
        </device>

        <!-- *************************  Device 'STM32L486ZGTx'  ***************************** -->
        <device Dname="STM32L486ZGTx">
          <memory name="Main_Flash" access="rx"  id="IROM1"  start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00018000" init="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM" start="0x08000000" size="0x00100000"             default="1"/>

          <feature type="QFP" n="144"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32L451'  **************************** -->
      <subFamily DsubFamily="STM32L451">
        <compile header="Drivers/CMSIS/Device/ST/STM32L4xx/Include/stm32l4xx.h"  define="STM32L451xx"/>
        <debug svd="CMSIS/SVD/STM32L4x1.svd"/>

        <debugvars configfile="CMSIS/Debug/STM32L43x_44x_45x_46x.dbgconf">
          __var DbgMCU_CR       = 0x00000007;   // DBGMCU_CR: DBG_SLEEP, DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz1 = 0x00000000;   // DGBMCU_APB1_FZ1: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB1_Fz2 = 0x00000000;   // DGBMCU_APB1_FZ2: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz  = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
          __var TraceClk_Pin    = 0x00040002;   // PE2
          __var TraceD0_Pin     = 0x00040003;   // PE3
          __var TraceD1_Pin     = 0x00040004;   // PE4
          __var TraceD2_Pin     = 0x00040005;   // PE5
          __var TraceD3_Pin     = 0x00040006;   // PE6
          __var DoOptionByteLoading = 0;        // Disabled
        </debugvars>

        <memory id="IRAM1"                                 start="0x20000000" size="0x00020000" init="0" default="1"/>
        <memory id="IRAM2"                                 start="0x10000000" size="0x00008000" init="0" default="0"/>
        <algorithm name="CMSIS/Flash/STM32L4xx_SB_OPT.FLM" start="0x1FFF7800" size="0x00000014"          default="0"/>

        <book name="Documentation/DM00151940.pdf" title="STM32L43xxx STM32L44xxx STM32L45xxx STM32L46xxx Reference Manual"/>
        <book name="Documentation/DM00340475.pdf" title="STM32L451xx Data Sheet"/>
        <!-- ################################### 512 KB ################################## -->
        <!-- *************************  Device 'STM32L451RETx'  ***************************** -->
        <device Dname="STM32L451RETx">
          <memory name="Main_Flash" access="rx"  id="IROM1"    start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"    start="0x20000000" size="0x00020000" init="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_512.FLM"      start="0x08000000" size="0x00080000"             default="1"/>

          <feature type="QFP" n="64"/>
        </device>
        <!-- *************************  Device 'STM32L451REYx'  ***************************** -->
        <device Dname="STM32L451REYx">
          <memory name="Main_Flash" access="rx"  id="IROM1"    start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"    start="0x20000000" size="0x00020000" init="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_512.FLM"      start="0x08000000" size="0x00080000"             default="1"/>

          <feature type="CSP" n="64"/>
        </device>
        <!-- *************************  Device 'STM32L451REIx'  ***************************** -->
        <device Dname="STM32L451REIx">
          <memory name="Main_Flash" access="rx"  id="IROM1"    start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"    start="0x20000000" size="0x00020000" init="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_512.FLM"      start="0x08000000" size="0x00080000"             default="1"/>

          <feature type="BGA" n="64"/>
        </device>
        <!-- *************************  Device 'STM32L451CEUx'  ***************************** -->
        <device Dname="STM32L451CEUx">
          <memory name="Main_Flash" access="rx"  id="IROM1"    start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"    start="0x20000000" size="0x00020000" init="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_512.FLM"      start="0x08000000" size="0x00080000"             default="1"/>

          <feature type="QFN" n="48"/>
        </device>
        <!-- *************************  Device 'STM32L451VETx'  ***************************** -->
        <device Dname="STM32L451VETx">
          <memory name="Main_Flash" access="rx"  id="IROM1"    start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"    start="0x20000000" size="0x00020000" init="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_512.FLM"      start="0x08000000" size="0x00080000"             default="1"/>

          <feature type="QFP" n="100"/>
        </device>
        <!-- *************************  Device 'STM32L451VEIx'  ***************************** -->
        <device Dname="STM32L451VEIx">
          <memory name="Main_Flash" access="rx"  id="IROM1"    start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"    start="0x20000000" size="0x00020000" init="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_512.FLM"      start="0x08000000" size="0x00080000"             default="1"/>

          <feature type="BGA" n="100"/>
        </device>
        <!-- ################################### 256 KB ################################## -->
        <!-- *************************  Device 'STM32L451RCTx'  ***************************** -->
        <device Dname="STM32L451RCTx">
          <memory name="Main_Flash" access="rx" id="IROM1"     start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"    start="0x20000000" size="0x00020000" init="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_256.FLM" start="0x08000000" size="0x00040000"             default="1"/>
          <feature type="QFP" n="64"/>
        </device>
        <!-- *************************  Device 'STM32L451RCYx'  ***************************** -->
        <device Dname="STM32L451RCYx">
          <memory name="Main_Flash" access="rx" id="IROM1"     start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"    start="0x20000000" size="0x00020000" init="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_256.FLM" start="0x08000000" size="0x00040000"             default="1"/>
          <feature type="CSP" n="64"/>
        </device>
        <!-- *************************  Device 'STM32L451RCIx'  ***************************** -->
        <device Dname="STM32L451RCIx">
          <memory name="Main_Flash" access="rx" id="IROM1"     start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"    start="0x20000000" size="0x00020000" init="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_256.FLM" start="0x08000000" size="0x00040000"             default="1"/>
          <feature type="BGA" n="64"/>
        </device>

        <!-- *************************  Device 'STM32L451CCUx'  ***************************** -->
        <device Dname="STM32L451CCUx">
          <memory name="Main_Flash" access="rx" id="IROM1"     start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"    start="0x20000000" size="0x00020000" init="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_256.FLM" start="0x08000000" size="0x00040000"             default="1"/>
          <feature type="QFN" n="48"/>
        </device>
        <!-- *************************  Device 'STM32L451VCTx'  ***************************** -->
        <device Dname="STM32L451VCTx">
          <memory name="Main_Flash" access="rx" id="IROM1"     start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"    start="0x20000000" size="0x00020000" init="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_256.FLM" start="0x08000000" size="0x00040000"             default="1"/>
          <feature type="QFP" n="100"/>
        </device>
        <!-- *************************  Device 'STM32L451VCIx'  ***************************** -->
        <device Dname="STM32L451VCIx">
          <memory name="Main_Flash" access="rx" id="IROM1"     start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"    start="0x20000000" size="0x00020000" init="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_256.FLM" start="0x08000000" size="0x00040000"             default="1"/>
          <feature type="BGA" n="100"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32L452'  **************************** -->
      <subFamily DsubFamily="STM32L452">
        <compile header="Drivers/CMSIS/Device/ST/STM32L4xx/Include/stm32l4xx.h"  define="STM32L452xx"/>
        <debug svd="CMSIS/SVD/STM32L4x2.svd"/>

        <debugvars configfile="CMSIS/Debug/STM32L43x_44x_45x_46x.dbgconf">
          __var DbgMCU_CR       = 0x00000007;   // DBGMCU_CR: DBG_SLEEP, DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz1 = 0x00000000;   // DGBMCU_APB1_FZ1: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB1_Fz2 = 0x00000000;   // DGBMCU_APB1_FZ2: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz  = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
          __var TraceClk_Pin    = 0x00040002;   // PE2
          __var TraceD0_Pin     = 0x00040003;   // PE3
          __var TraceD1_Pin     = 0x00040004;   // PE4
          __var TraceD2_Pin     = 0x00040005;   // PE5
          __var TraceD3_Pin     = 0x00040006;   // PE6
          __var DoOptionByteLoading = 0;        // Disabled
        </debugvars>

        <memory id="IRAM1"                                 start="0x20000000" size="0x00020000" init="0" default="1"/>
        <memory id="IRAM2"                                 start="0x10000000" size="0x00008000" init="0" default="0"/>
        <algorithm name="CMSIS/Flash/STM32L4xx_SB_OPT.FLM" start="0x1FFF7800" size="0x00000014"          default="0"/>

        <book name="Documentation/DM00151940.pdf" title="STM32L43xxx STM32L44xxx STM32L45xxx STM32L46xxx Reference Manual"/>
        <book name="Documentation/DM00340549.pdf" title="STM32L452xx Data Sheet"/>
        <!-- ################################### 512 KB ################################## -->
        <!-- *************************  Device 'STM32L452RETx'  ***************************** -->
        <device Dname="STM32L452RETx">
          <memory name="Main_Flash" access="rx"  id="IROM1"  start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00020000" init="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_512.FLM"     start="0x08000000" size="0x00080000"             default="1"/>
          <feature type="QFP" n="64"/>
        </device>
        <!-- *************************  Device 'STM32L452REYx'  ***************************** -->
        <device Dname="STM32L452REYx">
          <memory name="Main_Flash" access="rx"  id="IROM1"  start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00020000" init="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_512.FLM"     start="0x08000000" size="0x00080000"             default="1"/>
          <feature type="CSP" n="64"/>
        </device>
        <!-- *************************  Device 'STM32L452REIx'  ***************************** -->
        <device Dname="STM32L452REIx">
          <memory name="Main_Flash" access="rx"  id="IROM1"  start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00020000" init="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_512.FLM"     start="0x08000000" size="0x00080000"             default="1"/>
          <feature type="BGA" n="64"/>
        </device>
        <!-- *************************  Device 'STM32L452CEUx'  ***************************** -->
        <device Dname="STM32L452CEUx">
          <memory name="Main_Flash" access="rx"  id="IROM1"  start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00020000" init="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_512.FLM"     start="0x08000000" size="0x00080000"             default="1"/>
          <feature type="QFN" n="48"/>
        </device>
        <!-- *************************  Device 'STM32L452VETx'  ***************************** -->
        <device Dname="STM32L452VETx">
          <memory name="Main_Flash" access="rx"  id="IROM1"  start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00020000" init="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_512.FLM"     start="0x08000000" size="0x00080000"             default="1"/>
          <feature type="QFP" n="100"/>
        </device>
