armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32L4xx/Keil.STM32L4xx_DFP.pdsc
        <!-- *************************  Device 'STM32L462REIx'  ***************************** -->
        <device Dname="STM32L462REIx">
          <memory name="Main_Flash" access="rx" id="IROM1"   start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00020000" init="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_512.FLM"    start="0x08000000" size="0x00080000"             default="1"/>
          <feature type="BGA" n="64"/>
        </device>
        <!-- *************************  Device 'STM32L462CEUx'  ***************************** -->
        <device Dname="STM32L462CEUx">
          <memory name="Main_Flash" access="rx" id="IROM1"   start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00020000" init="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_512.FLM"    start="0x08000000" size="0x00080000"             default="1"/>
          <feature type="QFN" n="48"/>
        </device>
        <!-- *************************  Device 'STM32L462VETx'  ***************************** -->
        <device Dname="STM32L462VETx">
          <memory name="Main_Flash" access="rx" id="IROM1"   start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00020000" init="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_512.FLM"    start="0x08000000" size="0x00080000"             default="1"/>
          <feature type="QFP" n="100"/>
        </device>
        <!-- *************************  Device 'STM32L462VEIx'  ***************************** -->
        <device Dname="STM32L462VEIx">
          <memory name="Main_Flash" access="rx" id="IROM1"   start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00020000" init="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_512.FLM"    start="0x08000000" size="0x00080000"             default="1"/>
          <feature type="BGA" n="100"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32L496'  **************************** -->
      <subFamily DsubFamily="STM32L496">
        <compile define="STM32L496xx" header="Drivers/CMSIS/Device/ST/STM32L4xx/Include/stm32l4xx.h"/>
        <debug svd="CMSIS/SVD/STM32L4x6.svd"/>

        <debugvars configfile="CMSIS/Debug/STM32L4x5_4x6.dbgconf">
          __var DbgMCU_CR       = 0x00000007;   // DBGMCU_CR: DBG_SLEEP, DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz1 = 0x00000000;   // DGBMCU_APB1_FZ1: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB1_Fz2 = 0x00000000;   // DGBMCU_APB1_FZ2: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz  = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
          __var TraceClk_Pin    = 0x00040002;   // PE2
          __var TraceD0_Pin     = 0x00040003;   // PE3
          __var TraceD1_Pin     = 0x00040004;   // PE4
          __var TraceD2_Pin     = 0x00040005;   // PE5
          __var TraceD3_Pin     = 0x00040006;   // PE6
          __var DoOptionByteLoading = 0;        // Disabled
        </debugvars>

        <memory id="IRAM1"                                 start="0x20000000" size="0x00040000" init="0" default="1"/>
        <memory id="IRAM2"                                 start="0x10000000" size="0x00010000" init="0" default="0"/>
        <algorithm name="CMSIS/Flash/STM32L4xx_DB_OPT.FLM" start="0x1FFF7800" size="0x00000014"          default="0"/>

        <book name="Documentation/DM00083560.pdf" title="STM32L4x5 STM32L4x6 Reference Manual"/>
        <book name="Documentation/DM00284211.pdf" title="STM32L496xx Data Sheet"/>
        <!-- ################################### 1 MB ################################## -->
        <!-- *************************  Device 'STM32L496RGTx'  ***************************** -->
        <device Dname="STM32L496RGTx">
          <memory name="Main_Flash" access="rx" id="IROM1"   start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00040000" init="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM"   start="0x08000000" size="0x00100000"             default="1"/>
          <feature n="64" type="QFP"/>
        </device>
        <!-- *************************  Device 'STM32L496VGTx'  ***************************** -->
        <device Dname="STM32L496VGTx">
          <memory name="Main_Flash" access="rx" id="IROM1"   start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00040000" init="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM"   start="0x08000000" size="0x00100000"             default="1"/>
          <feature n="100" type="QFP"/>
        </device>
        <!-- *************************  Device 'STM32L496VGYx'  ***************************** -->
        <device Dname="STM32L496VGYx">
          <memory name="Main_Flash" access="rx" id="IROM1"   start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00040000" init="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM"   start="0x08000000" size="0x00100000"             default="1"/>
          <feature n="100" type="CSP"/>
        </device>
        <!-- *************************  Device 'STM32L496QGIx'  ***************************** -->
        <device Dname="STM32L496QGIx">
          <memory name="Main_Flash" access="rx" id="IROM1"   start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00040000" init="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM"   start="0x08000000" size="0x00100000"             default="1"/>
          <feature n="132" type="BGA"/>
        </device>
        <!-- *************************  Device 'STM32L496ZGTx'  ***************************** -->
        <device Dname="STM32L496ZGTx">
          <memory name="Main_Flash" access="rx" id="IROM1"   start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00040000" init="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM"   start="0x08000000" size="0x00100000"             default="1"/>
          <feature n="144" type="QFP"/>
        </device>
        <!-- *************************  Device 'STM32L496ZGYx'  ***************************** -->
        <device Dname="STM32L496ZGYx">
          <memory name="Main_Flash" access="rx" id="IROM1"   start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00040000" init="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM"   start="0x08000000" size="0x00100000"             default="1"/>
          <feature n="144" type="CSP"/>
        </device>
        <!-- *************************  Device 'STM32L496AGIx'  ***************************** -->
        <device Dname="STM32L496AGIx">
          <memory name="Main_Flash" access="rx" id="IROM1"   start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1"  start="0x20000000" size="0x00040000" init="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM"   start="0x08000000" size="0x00100000"             default="1"/>
          <feature n="169" type="BGA"/>
        </device>
