armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32L4xx/Keil.STM32L4xx_DFP.pdsc
        <!-- *************************  Device 'STM32L4Q5RGTx'  ***************************** -->
        <device Dname="STM32L4Q5RGTx">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x100000" startup="1" default="1" />
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x20000"  init="0"    default="1" />
          <algorithm name="CMSIS/Flash/STM32L4P5xx_1M.FLM" start="0x08000000" size="0x100000" default="1" />
          <feature type="QFP" n="64"/>
        </device>
        <!-- *************************  Device 'STM32L4Q5VGTx'  ***************************** -->
        <device Dname="STM32L4Q5VGTx">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x100000" startup="1" default="1" />
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x20000"  init="0"    default="1" />
          <algorithm name="CMSIS/Flash/STM32L4P5xx_1M.FLM" start="0x08000000" size="0x100000" default="1" />
          <feature type="QFP" n="100"/>
        </device>

        <!-- *************************  Device 'STM32L4Q5QGTx'  ***************************** -->
        <device Dname="STM32L4Q5QGTx">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x100000" startup="1" default="1" />
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x20000"  init="0"    default="1" />
          <algorithm name="CMSIS/Flash/STM32L4P5xx_1M.FLM" start="0x08000000" size="0x100000" default="1" />
          <feature type="QFP" n="132"/>
        </device>

        <!-- *************************  Device 'STM32L4Q5ZGTx'  ***************************** -->
        <device Dname="STM32L4Q5ZGTx">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x100000" startup="1" default="1" />
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x20000"  init="0"    default="1" />
          <algorithm name="CMSIS/Flash/STM32L4P5xx_1M.FLM" start="0x08000000" size="0x100000" default="1" />
          <feature type="QFP" n="144"/>
        </device>
        <!-- *************************  Device 'STM32L4Q5AGTx'  ***************************** -->
        <device Dname="STM32L4Q5AGTx">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x100000" startup="1" default="1" />
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x20000"  init="0"    default="1" />
          <algorithm name="CMSIS/Flash/STM32L4P5xx_1M.FLM" start="0x08000000" size="0x100000" default="1" />
          <feature type="QFP" n="169"/>
        </device>
      </subFamily>
      <!-- ************************  Subfamily 'STM32L4P5'  **************************** -->
      <subFamily DsubFamily="STM32L4P5">
        <debug svd="CMSIS/SVD/STM32L4P5.svd"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32L4xx/Include/stm32l4xx.h" define="STM32L4P5xx"/>
        <book name="Documentation/DS12903.pdf" title="STM32L4P5xx Data Sheet"/>
        <debugvars configfile="CMSIS/Debug/STM32L4Rx_4Sx.dbgconf">
          __var DbgMCU_CR       = 0x00000007;   // DBGMCU_CR: DBG_SLEEP, DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz1 = 0x00000000;   // DGBMCU_APB1_FZ1: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB1_Fz2 = 0x00000000;   // DGBMCU_APB1_FZ2: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz  = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
          __var TraceClk_Pin    = 0x00040002;   // PE2
          __var TraceD0_Pin     = 0x00040003;   // PE3
          __var TraceD1_Pin     = 0x00040004;   // PE4
          __var TraceD2_Pin     = 0x00040005;   // PE5
          __var TraceD3_Pin     = 0x00040006;   // PE6
          __var DoOptionByteLoading = 0;        // Disabled
        </debugvars>

        <!-- ################################### 1 MB ################################## -->
        <!-- *************************  Device 'STM32L4P5CGTx'  ***************************** -->
        <device Dname="STM32L4P5CGTx">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x100000" startup="1" default="1" />
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x20000"  init="0"    default="1" />
          <algorithm name="CMSIS/Flash/STM32L4P5xx_1M.FLM" start="0x08000000" size="0x100000" default="1" />
          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32L4P5RGTx'  ***************************** -->
        <device Dname="STM32L4P5RGTx">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x100000" startup="1" default="1" />
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x20000"  init="0"    default="1" />
          <algorithm name="CMSIS/Flash/STM32L4P5xx_1M.FLM" start="0x08000000" size="0x100000" default="1" />
          <feature type="QFP" n="64"/>
        </device>
        <!-- *************************  Device 'STM32L4P5VGTx'  ***************************** -->
        <device Dname="STM32L4P5VGTx">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x100000" startup="1" default="1" />
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x20000"  init="0"    default="1" />
          <algorithm name="CMSIS/Flash/STM32L4P5xx_1M.FLM" start="0x08000000" size="0x100000" default="1" />
          <feature type="QFP" n="100"/>
        </device>

        <!-- *************************  Device 'STM32L4P5QGTx'  ***************************** -->
        <device Dname="STM32L4P5QGTx">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x100000" startup="1" default="1" />
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x20000"  init="0"    default="1" />
          <algorithm name="CMSIS/Flash/STM32L4P5xx_1M.FLM" start="0x08000000" size="0x100000" default="1" />
          <feature type="QFP" n="132"/>
        </device>
        <!-- *************************  Device 'STM32L4P5ZGTx'  ***************************** -->
        <device Dname="STM32L4P5ZGTx">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x100000" startup="1" default="1" />
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x20000"  init="0"    default="1" />
          <algorithm name="CMSIS/Flash/STM32L4P5xx_1M.FLM" start="0x08000000" size="0x100000" default="1" />
          <feature type="QFP" n="144"/>
        </device>

