armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32L4xx/Keil.STM32L4xx_DFP.pdsc
        <!-- *************************  Device 'STM32L4P5AGTx'  ***************************** -->
        <device Dname="STM32L4P5AGTx">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x100000" startup="1" default="1" />
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x20000"  init="0"    default="1" />
          <algorithm name="CMSIS/Flash/STM32L4P5xx_1M.FLM" start="0x08000000" size="0x100000" default="1" />
          <feature type="QFP" n="169"/>
        </device>

      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="STM32L4">
      <description>STMicroelectronics STM32L4 Series Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L4*"/>
    </condition>
    <condition id="STM32L412">
      <description>STMicroelectronics STM32L412 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L412*"/>
    </condition>
    <condition id="STM32L422">
      <description>STMicroelectronics STM32L422 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L422*"/>
    </condition>
    <condition id="STM32L431">
      <description>STMicroelectronics STM32L431 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L431*"/>
    </condition>
    <condition id="STM32L432">
      <description>STMicroelectronics STM32L432 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L432*"/>
    </condition>
    <condition id="STM32L433">
      <description>STMicroelectronics STM32L433 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L433*"/>
    </condition>
    <condition id="STM32L442">
      <description>STMicroelectronics STM32L442 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L442*"/>
    </condition>
    <condition id="STM32L443">
      <description>STMicroelectronics STM32L443 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L443*"/>
    </condition>
    <condition id="STM32L471">
      <description>STMicroelectronics STM32L471 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L471*"/>
    </condition>
    <condition id="STM32L475">
      <description>STMicroelectronics STM32L475 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L475*"/>
    </condition>
    <condition id="STM32L476">
      <description>STMicroelectronics STM32L476 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L476*"/>
    </condition>
    <condition id="STM32L485">
      <description>STMicroelectronics STM32L485 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L485*"/>
    </condition>
    <condition id="STM32L486">
      <description>STMicroelectronics STM32L486 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L486*"/>
    </condition>
    <condition id="STM32L451">
      <description>STMicroelectronics STM32L451 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L451*"/>
    </condition>
    <condition id="STM32L452">
      <description>STMicroelectronics STM32L452 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L452*"/>
    </condition>
    <condition id="STM32L462">
      <description>STMicroelectronics STM32L462 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L462*"/>
    </condition>
    <condition id="STM32L4A6">
      <description>STMicroelectronics STM32L4A6 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L4A6*"/>
    </condition>
    <condition id="STM32L496">
      <description>STMicroelectronics STM32L496 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L496*"/>
    </condition>
    <condition id="STM32L4R5">
      <description>STMicroelectronics STM32L4R5 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L4R5*"/>
    </condition>
    <condition id="STM32L4R7">
      <description>STMicroelectronics STM32L4R7 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L4R7*"/>
    </condition>
    <condition id="STM32L4R9">
      <description>STMicroelectronics STM32L4R9 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L4R9*"/>
    </condition>
    <condition id="STM32L4S5">
      <description>STMicroelectronics STM32L4S5 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L4S5*"/>
    </condition>
    <condition id="STM32L4S7">
      <description>STMicroelectronics STM32L4S7 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L4S7*"/>
    </condition>
    <condition id="STM32L4S9">
      <description>STMicroelectronics STM32L4S9 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L4S9*"/>
    </condition>
    <condition id="STM32L4P5">
      <description>STMicroelectronics STM32L4P5 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L4P5*"/>
    </condition>
    <condition id="STM32L4Q5">
      <description>STMicroelectronics STM32L4Q5 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L4Q5*"/>
    </condition>

    <condition id="STM32L412_422">
      <description>STMicroelectronics STM32L412/422 Series devices</description>
      <accept  condition="STM32L412"/>
      <accept  condition="STM32L422"/>
    </condition>
    <condition id="STM32L4A6_4R5_4R7_4R9_4S5_4S7_4S9">
      <description>STMicroelectronics STM32L4A6/4R5/4R7/4R9/4S5/4S7/4S9 Series devices</description>
      <accept  condition="STM32L4A6"/>
      <accept  condition="STM32L4R5"/>
      <accept  condition="STM32L4R7"/>
      <accept  condition="STM32L4R9"/>
      <accept  condition="STM32L4S5"/>
      <accept  condition="STM32L4S7"/>
      <accept  condition="STM32L4S9"/>
    </condition>
    <condition id="STM32L496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5">
      <description>STMicroelectronics STM32L496/4A6/4R5/4R7/4R9/4S5/4S7/4S9/4P5/4Q5 Series devices</description>
      <accept  condition="STM32L496"/>
      <accept  condition="STM32L4A6"/>
      <accept  condition="STM32L4R5"/>
      <accept  condition="STM32L4R7"/>
      <accept  condition="STM32L4R9"/>
      <accept  condition="STM32L4S5"/>
      <accept  condition="STM32L4S7"/>
      <accept  condition="STM32L4S9"/>
      <accept  condition="STM32L4P5"/>
      <accept  condition="STM32L4Q5"/>
    </condition>
    <condition id="STM32L4R9_4S9">
      <description>STMicroelectronics STM32L4R9/4S9 Series devices</description>
      <accept  condition="STM32L4R9"/>
      <accept  condition="STM32L4S9"/>
    </condition>
    <condition id="STM32L4R7_4R9_4S7_4S9">
      <description>STMicroelectronics STM32L4R7/4R9/4S7/4S9 Series devices</description>
      <accept  condition="STM32L4R7"/>
      <accept  condition="STM32L4R9"/>
      <accept  condition="STM32L4S7"/>
      <accept  condition="STM32L4S9"/>
    </condition>
    <condition id="STM32L4R7_4R9_4S7_4S9_4P5_4Q5">
      <description>STMicroelectronics STM32L4R7/4R9/4S7/4S9/4P5/4Q5 Series devices</description>
      <accept  condition="STM32L4R7"/>
      <accept  condition="STM32L4R9"/>
      <accept  condition="STM32L4S7"/>
      <accept  condition="STM32L4S9"/>
      <accept  condition="STM32L4P5"/>
      <accept  condition="STM32L4Q5"/>
    </condition>
    <condition id="STM32L4R5_4R7_4R9_4S5_4S7_4S9">
      <description>STMicroelectronics L4R5/4R7/4R9/4S5/4S7/4S9 Series devices</description>
      <accept  condition="STM32L4R5"/>
      <accept  condition="STM32L4R7"/>
      <accept  condition="STM32L4R9"/>
      <accept  condition="STM32L4S5"/>
      <accept  condition="STM32L4S7"/>
      <accept  condition="STM32L4S9"/>
    </condition>
