armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32L4xx/Keil.STM32L4xx_DFP.pdsc
    <condition id="STM32L4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5">
      <description>STMicroelectronics L4R5/4R7/4R9/4S5/4S7/4S9/4P5/4Q5 Series devices</description>
      <accept  condition="STM32L4R5"/>
      <accept  condition="STM32L4R7"/>
      <accept  condition="STM32L4R9"/>
      <accept  condition="STM32L4S5"/>
      <accept  condition="STM32L4S7"/>
      <accept  condition="STM32L4S9"/>
      <accept  condition="STM32L4P5"/>
      <accept  condition="STM32L4Q5"/>
    </condition>
    <condition id="STM32L422_442_443_462_485_486_4A6_4S5_4S7_4S9_4Q5">
      <description>STMicroelectronics STM32L422/442/443/462/485/486/4A6/4S5/4S7/4S9/4Q5 Series devices</description>
      <accept  condition="STM32L422"/>
      <accept  condition="STM32L442"/>
      <accept  condition="STM32L443"/>
      <accept  condition="STM32L462"/>
      <accept  condition="STM32L485"/>
      <accept  condition="STM32L486"/>
      <accept  condition="STM32L4A6"/>
      <accept  condition="STM32L4S5"/>
      <accept  condition="STM32L4S7"/>
      <accept  condition="STM32L4S9"/>
      <accept  condition="STM32L4Q5"/>
    </condition>
    <condition id="STM32L475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5">
      <description>STMicroelectronics STM32L475/476/485/486/496/4A6/4R5/4R7/4R9/4S5/4S7/4S9/4P5/4Q5 Series devices</description>
      <accept  condition="STM32L475"/>
      <accept  condition="STM32L476"/>
      <accept  condition="STM32L485"/>
      <accept  condition="STM32L486"/>
      <accept  condition="STM32L496"/>
      <accept  condition="STM32L4A6"/>
      <accept  condition="STM32L4R5"/>
      <accept  condition="STM32L4R7"/>
      <accept  condition="STM32L4R9"/>
      <accept  condition="STM32L4S5"/>
      <accept  condition="STM32L4S7"/>
      <accept  condition="STM32L4S9"/>
      <accept  condition="STM32L4P5"/>
      <accept  condition="STM32L4Q5"/>
    </condition>
    <condition id="STM32L451_452_462_471_475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5">
      <description>STMicroelectronics STM32L451/452/462/471/475/476/485/486/496/4A6/4R5/4R7/4R9/4S5/4S7/4S9/4P5/4Q5 Series Devices</description>
      <accept condition="STM32L451"/>
      <accept condition="STM32L452"/>
      <accept condition="STM32L462"/>
      <accept condition="STM32L471"/>
      <accept condition="STM32L475"/>
      <accept condition="STM32L476"/>
      <accept condition="STM32L485"/>
      <accept condition="STM32L486"/>
      <accept condition="STM32L496"/>
      <accept condition="STM32L4A6"/>
      <accept condition="STM32L4R5"/>
      <accept condition="STM32L4R7"/>
      <accept condition="STM32L4R9"/>
      <accept condition="STM32L4S5"/>
      <accept condition="STM32L4S7"/>
      <accept condition="STM32L4S9"/>
      <accept condition="STM32L4P5"/>
      <accept condition="STM32L4Q5"/>
    </condition>
    <condition id="STM32L431_432_433_442_443_471_475_476_485_486_496_4A6">
      <description>STMicroelectronics STM32L431/432/433/442/443/471/475/476/485/486/496/4A6 Series Devices</description>
      <accept condition="STM32L431"/>
      <accept condition="STM32L432"/>
      <accept condition="STM32L433"/>
      <accept condition="STM32L442"/>
      <accept condition="STM32L443"/>
      <accept condition="STM32L471"/>
      <accept condition="STM32L475"/>
      <accept condition="STM32L476"/>
      <accept condition="STM32L485"/>
      <accept condition="STM32L486"/>
      <accept condition="STM32L496"/>
      <accept condition="STM32L4A6"/>
    </condition>
    <condition id="STM32L471_475_476_485_486_496_4A6">
      <description>STMicroelectronics STM32L471/475/476/485/486/496/4A6 Series Devices</description>
      <accept condition="STM32L471"/>
      <accept condition="STM32L475"/>
      <accept condition="STM32L476"/>
      <accept condition="STM32L485"/>
      <accept condition="STM32L486"/>
      <accept condition="STM32L496"/>
      <accept condition="STM32L4A6"/>
    </condition>
    <condition id="STM32L471_475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5">
      <description>STMicroelectronics STM32L471/475/476/485/486/496/4A6/4R5/4R7/4R9/4S5/4S7/4S9/4P5/4Q5 Series Devices</description>
      <accept condition="STM32L471"/>
      <accept condition="STM32L475"/>
      <accept condition="STM32L476"/>
      <accept condition="STM32L485"/>
      <accept condition="STM32L486"/>
      <accept condition="STM32L496"/>
      <accept condition="STM32L4A6"/>
      <accept condition="STM32L4R5"/>
      <accept condition="STM32L4R7"/>
      <accept condition="STM32L4R9"/>
      <accept condition="STM32L4S5"/>
      <accept condition="STM32L4S7"/>
      <accept condition="STM32L4S9"/>
      <accept condition="STM32L4P5"/>
      <accept condition="STM32L4Q5"/>
    </condition>
    <condition id="STM32L431_433_443_451_452_462_471_475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5">
      <description>STMicroelectronics STM32L431/433/443/451/452/462/471/475/476/485/486/496/4A6/4R5/4R7/4R9/4S5/4S7/4S9/4P5/4Q5 Series Devices</description>
      <accept condition="STM32L431"/>
      <accept condition="STM32L433"/>
      <accept condition="STM32L443"/>
      <accept condition="STM32L451"/>
      <accept condition="STM32L452"/>
      <accept condition="STM32L462"/>
      <accept condition="STM32L471"/>
      <accept condition="STM32L475"/>
      <accept condition="STM32L476"/>
      <accept condition="STM32L485"/>
      <accept condition="STM32L486"/>
      <accept condition="STM32L496"/>
      <accept condition="STM32L4A6"/>
      <accept condition="STM32L4R5"/>
      <accept condition="STM32L4R7"/>
      <accept condition="STM32L4R9"/>
      <accept condition="STM32L4S5"/>
      <accept condition="STM32L4S7"/>
      <accept condition="STM32L4S9"/>
      <accept condition="STM32L4P5"/>
      <accept condition="STM32L4Q5"/>
    </condition>
    <condition id="STM32L431_432_433_442_443_451_452_462_471_475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5">
      <description>STMicroelectronics STM32L431/432//433/442/443/451/452/462/471/475/476/485/486/496/4A6/4R5/4R7/4R9/4S5/4S7/4S9/4P5/4Q5 Series Devices</description>
      <accept condition="STM32L431"/>
      <accept condition="STM32L432"/>
      <accept condition="STM32L433"/>
      <accept condition="STM32L442"/>
      <accept condition="STM32L443"/>
      <accept condition="STM32L451"/>
      <accept condition="STM32L452"/>
      <accept condition="STM32L462"/>
      <accept condition="STM32L471"/>
      <accept condition="STM32L475"/>
      <accept condition="STM32L476"/>
      <accept condition="STM32L485"/>
      <accept condition="STM32L486"/>
      <accept condition="STM32L496"/>
      <accept condition="STM32L4A6"/>
      <accept condition="STM32L4R5"/>
      <accept condition="STM32L4R7"/>
      <accept condition="STM32L4R9"/>
      <accept condition="STM32L4S5"/>
      <accept condition="STM32L4S7"/>
      <accept condition="STM32L4S9"/>
      <accept condition="STM32L4P5"/>
      <accept condition="STM32L4Q5"/>
    </condition>          
    <condition id="STM32L412_422_432_433_442_443_452_462">
      <description>STMicroelectronics STM32L412/422/432/433/442/443/452/462 Series Devices</description>
      <accept condition="STM32L412"/>
      <accept condition="STM32L422"/>
      <accept condition="STM32L432"/>
      <accept condition="STM32L433"/>
      <accept condition="STM32L442"/>
      <accept condition="STM32L443"/>
      <accept condition="STM32L452"/>
      <accept condition="STM32L462"/>
    </condition>
    <condition id="STM32L412_422_432_433_442_443_452_462_475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5">
      <description>STMicroelectronics STM32L412/422/432/433/442/443/452/462/475/476/485/486/496/4A6/4R5/4R7/4R9/4S5/4S7/4S9/4P5/4Q5 Series Devices</description>
      <accept condition="STM32L412"/>
      <accept condition="STM32L422"/>
      <accept condition="STM32L432"/>
      <accept condition="STM32L433"/>
      <accept condition="STM32L442"/>
      <accept condition="STM32L443"/>
      <accept condition="STM32L452"/>
      <accept condition="STM32L462"/>
      <accept condition="STM32L475"/>
      <accept condition="STM32L476"/>
      <accept condition="STM32L485"/>
      <accept condition="STM32L486"/>
      <accept condition="STM32L496"/>
      <accept condition="STM32L4A6"/>
      <accept condition="STM32L4R5"/>
      <accept condition="STM32L4R7"/>
      <accept condition="STM32L4R9"/>
      <accept condition="STM32L4S5"/>
      <accept condition="STM32L4S7"/>
      <accept condition="STM32L4S9"/>
      <accept condition="STM32L4P5"/>
      <accept condition="STM32L4Q5"/>
    </condition>
    <condition id="STM32L433_443_476_486_496_4A6">
      <description>STMicroelectronics STM32L433/443/476/486/496/4A6 Series Devices</description>
      <accept condition="STM32L433"/>
      <accept condition="STM32L443"/>
      <accept condition="STM32L476"/>
      <accept condition="STM32L486"/>
      <accept condition="STM32L496"/>
      <accept condition="STM32L4A6"/>
    </condition>
    <condition id="STM32L4A6_4S5_4S7_4S9_4P5_4Q5">
      <description>STMicroelectronics STM32L4A6/4S5/4S7/4S9/4P5/4Q5 Series Devices</description>
      <accept condition="STM32L4A6"/>
      <accept condition="STM32L4S5"/>
      <accept condition="STM32L4S7"/>
      <accept condition="STM32L4S9"/>
      <accept condition="STM32L4P5"/>
      <accept condition="STM32L4Q5"/>
    </condition>
    <condition id="STM32L431_432_433_442_443_451_452_462">
      <description>STMicroelectronics STM32L431/432/433/442/443/451/452/462 Series Devices</description>
      <accept condition="STM32L431"/>
      <accept condition="STM32L432"/>
      <accept condition="STM32L433"/>
      <accept condition="STM32L442"/>
      <accept condition="STM32L443"/>
      <accept condition="STM32L451"/>
      <accept condition="STM32L452"/>
      <accept condition="STM32L462"/>
    </condition>
    <condition id="STM32L412_422_431_432_433_442_443_451_452_462_471_475_476_485_486_496_4A6">
      <description>STMicroelectronics STM32L412/422/431/432/433/442/443/451/452/462/471/475/476/485/486/496/4A6 Series Devices</description>
      <accept condition="STM32L412"/>
      <accept condition="STM32L422"/>
      <accept condition="STM32L431"/>
      <accept condition="STM32L432"/>
      <accept condition="STM32L433"/>
      <accept condition="STM32L442"/>
      <accept condition="STM32L443"/>
      <accept condition="STM32L451"/>
      <accept condition="STM32L452"/>
      <accept condition="STM32L462"/>
      <accept condition="STM32L471"/>
      <accept condition="STM32L475"/>
      <accept condition="STM32L476"/>
      <accept condition="STM32L485"/>
      <accept condition="STM32L486"/>
      <accept condition="STM32L496"/>
      <accept condition="STM32L4A6"/>
    </condition>
    <condition id="STM32L412_422_431_432_433_442_443_451_452_462_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5">
      <description>STMicroelectronics STM32L412/422/431/432/433/442/443/451/452/462/496/4A6/4R5/4R7/4R9/4S5/4S7/4S9/4P5/4Q5 Series Devices</description>
      <accept condition="STM32L412"/>
      <accept condition="STM32L422"/>
      <accept condition="STM32L431"/>
      <accept condition="STM32L432"/>
      <accept condition="STM32L433"/>
      <accept condition="STM32L442"/>
      <accept condition="STM32L443"/>
      <accept condition="STM32L451"/>
      <accept condition="STM32L452"/>
      <accept condition="STM32L462"/>
      <accept condition="STM32L496"/>
      <accept condition="STM32L4A6"/>
      <accept condition="STM32L4R5"/>
      <accept condition="STM32L4R7"/>
      <accept condition="STM32L4R9"/>
      <accept condition="STM32L4S5"/>
      <accept condition="STM32L4S7"/>
      <accept condition="STM32L4S9"/>
      <accept condition="STM32L4P5"/>
      <accept condition="STM32L4Q5"/>
    </condition>
    <condition id="STM32L4P5_4Q5">
      <description>STMicroelectronics STM32L4P5/4Q5 Series devices</description>
      <accept  condition="STM32L4P5"/>
      <accept  condition="STM32L4Q5"/>
    </condition>

    <!-- Device + Compiler Conditions -->
    <condition id="STM32L412 ARMCC">
      <description>STMicroelectronics STM32L412 Series Devices and ARMCC</description>
      <require condition="STM32L412"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L422 ARMCC">
      <description>STMicroelectronics STM32L422 Series Devices and ARMCC</description>
      <require condition="STM32L422"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L431 ARMCC">
      <description>STMicroelectronics STM32L431 Series Devices and ARMCC</description>
      <require condition="STM32L431"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L432 ARMCC">
      <description>STMicroelectronics STM32L432 Series Devices and ARMCC</description>
      <require condition="STM32L432"/>
      <require condition="Compiler ARMCC"/>
    </condition>
