armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32L4xx/Keil.STM32L4xx_DFP.pdsc
    <condition id="STM32L4R9I-EVAL BSP RGB-TS">
      <description>STMicroelectronics STM32L4R9I-EVAL BSP RGB-TS</description>
      <require condition="STM32L4R9"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="I/O"/>
    </condition>
    <condition id="STM32L4R9I-EVAL BSP SD">
      <description>STMicroelectronics STM32L4R9I-EVAL BSP SD</description>
      <require condition="STM32L4R9"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="SD"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="I/O"/>
    </condition>
    <condition id="STM32L4R9I-EVAL BSP SRAM">
      <description>STMicroelectronics STM32L4R9I-EVAL BSP SRAM</description>
      <require condition="STM32L4R9"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="SRAM"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>
    <condition id="STM32L4R9I-EVAL LED">
      <description>STMicroelectronics STM32L4R9I-Eval LED</description>
      <require condition="STM32L4R9"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Basic I/O"/>
    </condition>
    <condition id="STM32L4R9I-EVAL Buttons">
      <description>STMicroelectronics STM32L4R9I-Eval Buttons</description>
      <require condition="STM32L4R9"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Basic I/O"/>
    </condition>
    <condition id="STM32L4R9I-EVAL Joystick">
      <description>STMicroelectronics STM32L4R9I-Eval Joystick</description>
      <require condition="STM32L4R9"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Basic I/O"/>
    </condition>
    <condition id="STM32L4R9I-EVAL ADC">
      <description>STMicroelectronics STM32L4R9I-Eval ADC</description>
      <require condition="STM32L4R9"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="ADC"/>
    </condition>

    <!-- B-L475E-IOT01 BSP Conditions -->
    <condition id="B-L475E-IOT01 BSP">
      <description>Requirements for B-L475E-IOT01 Board</description>
      <require condition="STM32L475"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="I2C"/>
    </condition>
  </conditions>

  <generators>
    <!-- This generator is launched if any component referencing this generator by 'id' is selected and the specified <gpdsc> file does not exist -->
    <generator id="STM32CubeMX">
      <description>ST Microelectronics: STCubeMX Environment</description>
      <command>MDK/CubeMX/STM32CubeMxLauncher.exe</command>
      <!-- path is specified either absolute or relative to PDSC or GPDSC file -->
      <workingDir>$PRTE/Device</workingDir>
      <!-- path is specified either absolute or relative to PDSC or GPDSC file. If not specified it is the project directory configured by the environment -->
      <arguments>
        <!-- D = Device (Dname/Dvariant as configured by environment) -->
        <argument>$D</argument>
        <!-- Project path and project name (as configured by environment) -->
        <argument>#P</argument>
        <!-- absolute or relative to workingDir. $S = Device Family Pack base folder -->
        <argument>$S</argument>
      </arguments>
      <!-- path is either absolute or relative to working directory -->
      <gpdsc name="$PRTE/Device/$D/FrameworkCubeMX.gpdsc"/>
    </generator>
  </generators>

  <taxonomy>
    <description Cclass="Device" Cgroup="STM32Cube HAL">STM32L4xx Hardware Abstraction Layer (HAL) Drivers</description>
  </taxonomy>

  <apis>
    <api Cclass="Device" Cgroup="STM32Cube Framework" Capiversion="1.1.0" exclusive="1">
      <description>STM32Cube Framework</description>
      <files>
        <file category="doc" name="MDK/CubeMX/Documentation/index.html"/>
      </files>
    </api>
  </apis>

  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.3.1" condition="STM32L4 CMSIS">
      <!-- Cversion is necessary -->
      <description>System Startup for STMicroelectronics STM32L4 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_DEVICE_STARTUP_STM32L4XX    /* Device Startup for STM32L4 */
      </RTE_Components_h>

      <files>
        <!--  include folder -->
        <file category="include" name="Drivers/CMSIS/Device/ST/STM32L4xx/Include/"/>

        <!-- Flash Option Bytes templates -->
        <file category="source" condition="STM32L431_432_433_442_443_451_452_462 ARMCC" name="MDK/Device/Source/ARM/STM32L4xx_SB_OPT.s" attr="template" select="Flash Option Bytes"/>
        <file category="source" condition="STM32L471_475_476_485_486_496_4A6 ARMCC"     name="MDK/Device/Source/ARM/STM32L4xx_DB_OPT.s" attr="template" select="Flash Option Bytes"/>
        <file category="source" condition="STM32L4R5_4R7_4R9_4S5_4S7_4S9 ARMCC"         name="MDK/Device/Source/ARM/STM32L4Rx_SB_OPT.s" attr="template" select="Flash Option Bytes"/>
        <file category="source" condition="STM32L4R5_4R7_4R9_4S5_4S7_4S9 ARMCC"         name="MDK/Device/Source/ARM/STM32L4Rx_DB_OPT.s" attr="template" select="Flash Option Bytes"/>

        <file category="header" name="Drivers/CMSIS/Device/ST/STM32L4xx/Include/stm32l4xx.h"/>

        <!-- startup files -->
        <!-- ARM Compiler Toolchain -->
        <file category="source" condition="STM32L412 ARMCC"  name="Drivers/CMSIS/Device/ST/STM32L4xx/Source/Templates/arm/startup_stm32l412xx.s" attr="config" version="1.3.1"/>
        <file category="source" condition="STM32L422 ARMCC"  name="Drivers/CMSIS/Device/ST/STM32L4xx/Source/Templates/arm/startup_stm32l422xx.s" attr="config" version="1.3.1"/>
        <file category="source" condition="STM32L431 ARMCC"  name="Drivers/CMSIS/Device/ST/STM32L4xx/Source/Templates/arm/startup_stm32l431xx.s" attr="config" version="1.3.1"/>
        <file category="source" condition="STM32L432 ARMCC"  name="Drivers/CMSIS/Device/ST/STM32L4xx/Source/Templates/arm/startup_stm32l432xx.s" attr="config" version="1.3.1"/>
        <file category="source" condition="STM32L433 ARMCC"  name="Drivers/CMSIS/Device/ST/STM32L4xx/Source/Templates/arm/startup_stm32l433xx.s" attr="config" version="1.3.1"/>
        <file category="source" condition="STM32L442 ARMCC"  name="Drivers/CMSIS/Device/ST/STM32L4xx/Source/Templates/arm/startup_stm32l442xx.s" attr="config" version="1.3.1"/>
        <file category="source" condition="STM32L443 ARMCC"  name="Drivers/CMSIS/Device/ST/STM32L4xx/Source/Templates/arm/startup_stm32l443xx.s" attr="config" version="1.3.1"/>
        <file category="source" condition="STM32L451 ARMCC"  name="Drivers/CMSIS/Device/ST/STM32L4xx/Source/Templates/arm/startup_stm32l451xx.s" attr="config" version="1.3.1"/>
        <file category="source" condition="STM32L452 ARMCC"  name="Drivers/CMSIS/Device/ST/STM32L4xx/Source/Templates/arm/startup_stm32l452xx.s" attr="config" version="1.3.1"/>
        <file category="source" condition="STM32L462 ARMCC"  name="Drivers/CMSIS/Device/ST/STM32L4xx/Source/Templates/arm/startup_stm32l462xx.s" attr="config" version="1.3.1"/>
        <file category="source" condition="STM32L471 ARMCC"  name="Drivers/CMSIS/Device/ST/STM32L4xx/Source/Templates/arm/startup_stm32l471xx.s" attr="config" version="1.3.1"/>
        <file category="source" condition="STM32L475 ARMCC"  name="Drivers/CMSIS/Device/ST/STM32L4xx/Source/Templates/arm/startup_stm32l475xx.s" attr="config" version="1.3.1"/>
        <file category="source" condition="STM32L476 ARMCC"  name="Drivers/CMSIS/Device/ST/STM32L4xx/Source/Templates/arm/startup_stm32l476xx.s" attr="config" version="1.3.1"/>
        <file category="source" condition="STM32L485 ARMCC"  name="Drivers/CMSIS/Device/ST/STM32L4xx/Source/Templates/arm/startup_stm32l485xx.s" attr="config" version="1.3.1"/>
        <file category="source" condition="STM32L486 ARMCC"  name="Drivers/CMSIS/Device/ST/STM32L4xx/Source/Templates/arm/startup_stm32l486xx.s" attr="config" version="1.3.1"/>
        <file category="source" condition="STM32L496 ARMCC"  name="Drivers/CMSIS/Device/ST/STM32L4xx/Source/Templates/arm/startup_stm32l496xx.s" attr="config" version="1.3.1"/>
        <file category="source" condition="STM32L4A6 ARMCC"  name="Drivers/CMSIS/Device/ST/STM32L4xx/Source/Templates/arm/startup_stm32l4a6xx.s" attr="config" version="1.3.1"/>
        <file category="source" condition="STM32L4R5 ARMCC"  name="Drivers/CMSIS/Device/ST/STM32L4xx/Source/Templates/arm/startup_stm32l4r5xx.s" attr="config" version="1.3.1"/>
        <file category="source" condition="STM32L4R7 ARMCC"  name="Drivers/CMSIS/Device/ST/STM32L4xx/Source/Templates/arm/startup_stm32l4r7xx.s" attr="config" version="1.3.1"/>
        <file category="source" condition="STM32L4R9 ARMCC"  name="Drivers/CMSIS/Device/ST/STM32L4xx/Source/Templates/arm/startup_stm32l4r9xx.s" attr="config" version="1.3.1"/>
        <file category="source" condition="STM32L4S5 ARMCC"  name="Drivers/CMSIS/Device/ST/STM32L4xx/Source/Templates/arm/startup_stm32l4s5xx.s" attr="config" version="1.3.1"/>
        <file category="source" condition="STM32L4S7 ARMCC"  name="Drivers/CMSIS/Device/ST/STM32L4xx/Source/Templates/arm/startup_stm32l4s7xx.s" attr="config" version="1.3.1"/>
        <file category="source" condition="STM32L4S9 ARMCC"  name="Drivers/CMSIS/Device/ST/STM32L4xx/Source/Templates/arm/startup_stm32l4s9xx.s" attr="config" version="1.3.1"/>
        <file category="source" condition="STM32L4P5 ARMCC"  name="Drivers/CMSIS/Device/ST/STM32L4xx/Source/Templates/arm/startup_stm32l4p5xx.s" attr="config" version="1.6.0"/>
        <file category="source" condition="STM32L4Q5 ARMCC"  name="Drivers/CMSIS/Device/ST/STM32L4xx/Source/Templates/arm/startup_stm32l4q5xx.s" attr="config" version="1.6.0"/>

        <!-- system file -->
        <file category="source" name="Drivers/CMSIS/Device/ST/STM32L4xx/Source/Templates/system_stm32l4xx.c" attr="config" version="1.3.1"/>
      </files>
    </component>

    <component generator="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX" Cversion="1.0.0" Capiversion="1.1.0" condition="STM32L4">
      <description>Configuration via STM32CubeMX</description>
      <RTE_Components_h>
        #define RTE_DEVICE_FRAMEWORK_CUBE_MX
      </RTE_Components_h>
      <files>
        <!-- this component will be replaced by the component described in gpdsc from generator -->
        <!--
        <file category="doc"     name="MDK/CubeMX/Documentation/cubemx.html"/>
-->
        <file category="source"  name="MDK/CubeMX/run_STM32CubeMX.c" version="1.0"/>
        <file category="other"   name="MDK/CubeMX/FrameworkCubeMX_gpdsc.ftl" version="1.0"/>
        <file category="other"   name="MDK/CubeMX/MX_Device_h.ftl" version ="1.0.2"/>
      </files>
    </component>

    <!-- START: STMicroelectronics STM32CubeL4 HAL -->
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"    Cversion="1.11.0" condition="STM32L4 HAL Common">
      <description>Common HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_COMMON
      </RTE_Components_h>
      <files>
        <file category="include" name="Drivers/STM32L4xx_HAL_Driver/Inc/"/>
        <file category="include" name="Drivers/STM32L4xx_HAL_Driver/Inc/Legacy/"/>
        <file category="header"  name="Drivers/STM32L4xx_HAL_Driver/Inc/stm32l4xx_hal.h"/>
        <file category="source"  name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_hal.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="ADC"       Cversion="1.11.0" condition="STM32L4 HAL DMA">
      <description>Analog-to-digital converter (ADC) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_ADC
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_hal_adc.c"/>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_hal_adc_ex.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="CAN"       Cversion="1.11.0" condition="STM32L431_432_433_442_443_451_452_462_471_475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5 HAL">
      <description>Controller area network (CAN) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_CAN
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_hal_can.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="COMP"      Cversion="1.11.0" condition="STM32L4 HAL">
      <description>Analog Comparator (CRC) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_COMP
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_hal_comp.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="Cortex"    Cversion="1.11.0" condition="STM32L4 HAL">
      <description>Cortex HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_CORTEX
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_hal_cortex.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="CRC"       Cversion="1.11.0" condition="STM32L4 HAL">
      <description>CRC calculation unit (CRC) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_CRC
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_hal_crc.c"/>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_hal_crc_ex.c"/>
      </files>
    </component>
