armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32L4xx/Keil.STM32L4xx_DFP.pdsc
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="UTILS"  Cversion="1.11.0" condition="STM32L4">
      <description>UTILS LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_UTILS
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32L4xx_HAL_Driver/Src/stm32l4xx_ll_utils.c"/>
      </files>
    </component>
    <!-- END: STMicroelectronics STM32CubeL4 LL -->

    <!-- CMSIS drivers -->
    <component Cclass="CMSIS Driver" Cgroup="MCI"                          Capiversion="2.2.0" Cversion="1.0.0" condition="STM32L4 CMSIS_Driver MCI">
      <description>MCI Driver for STM32L4 Series</description>
      <RTE_Components_h>
        #define RTE_Drivers_MCI0                /* Driver MCI0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/MCI_STM32L4xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="SPI"                          Capiversion="2.1.0" Cversion="1.2.0" condition="STM32L4 CMSIS_Driver SPI">
      <description>SPI Driver for STM32L4 Series</description>
      <RTE_Components_h>
        #define RTE_Drivers_SPI1                /* Driver SPI1 */
        #define RTE_Drivers_SPI2                /* Driver SPI2 */
        #define RTE_Drivers_SPI3                /* Driver SPI3 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/SPI_STM32L4xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USART"                        Capiversion="2.1.0" Cversion="1.1.0" condition="STM32L4 CMSIS_Driver USART">
      <description>USART Driver for STM32L4 Series</description>
      <RTE_Components_h>
        #define RTE_Drivers_USART1              /* Driver USART1 */
        #define RTE_Drivers_USART2              /* Driver USART2 */
        #define RTE_Drivers_USART3              /* Driver USART3 */
        #define RTE_Drivers_USART4              /* Driver USART4 */
        #define RTE_Drivers_USART5              /* Driver USART5 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/UART_STM32L4xx.c"/>
        <file category="source" name="CMSIS/Driver/USART_STM32L4xx.c"/>
        <file category="source" name="CMSIS/Driver/IrDA_STM32L4xx.c"/>
        <file category="source" name="CMSIS/Driver/SmartCard_STM32L4xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USB Device" Csub="Full-speed" Capiversion="2.1.0" Cversion="1.2.0" condition="STM32L412_422_432_433_442_443_452_462 CMSIS_Driver USBD">
      <description>USB Device Full-Speed Driver for STM32L4 Series</description>
      <RTE_Components_h>
        #define RTE_Drivers_USBD0               /* Driver USBD0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/USBD_STM32L4xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USB Device" Csub="Full-speed" Capiversion="2.1.0" Cversion="1.3.0" condition="STM32L475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5 CMSIS_Driver USBD">
      <description>USB Device Full-Speed Driver (OTG) for STM32L4 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBD0               /* Driver USBD0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/OTG_STM32L4xx.c"/>
        <file category="source" name="CMSIS/Driver/USBD_OTG_STM32L4xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USB Host"   Csub="Full-speed" Capiversion="2.2.0" Cversion="1.1.0" condition="STM32L475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9_4P5_4Q5 CMSIS_Driver USBH">
      <description>USB Host Full-Speed Driver (OTG) for STM32L4 Series</description>
      <RTE_Components_h>
        #define RTE_Drivers_USBH0               /* Driver USBH0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/OTG_STM32L4xx.c"/>
        <file category="source" name="CMSIS/Driver/USBH_OTG_STM32L4xx.c"/>
      </files>
    </component>

    <!-- STM32L476G-EVAL Board Support -->
    <bundle Cbundle="STM32L476G-EVAL" Cclass="Board Support" Cversion="1.0.0">
      <description>STMicroelectronics STM32L476G-EVAL Board</description>
      <doc>MDK/Boards/ST/STM32L476G-EVAL/Documentation/DM00155732.pdf</doc>
      <component Cgroup="Drivers" Csub="Basic I/O"          condition="STM32L476G-EVAL BSP">
        <description>LEDs, push-buttons and COM ports for STMicroelectronics STM32L476G-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval.h"/>
          <file category="source" name="Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="Audio"              condition="STM32L476G-EVAL BSP Audio">
        <description>Audio for STMicroelectronics STM32L476G-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval_audio.h"/>
          <file category="source" name="Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval_audio.c"/>
          <file category="source" name="Drivers/BSP/Components/wm8994/wm8994.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="EEPROM"             condition="STM32L476G-EVAL BSP EEPROM">
        <description>EEPROM for STMicroelectronics STM32L476G-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval_eeprom.h"/>
          <file category="source" name="Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval_eeprom.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="Glass-LCD"          condition="STM32L476G-EVAL BSP Glass-LCD">
        <description>Glass-LCD for STMicroelectronics STM32L476G-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval_glass_lcd.h"/>
          <file category="source" name="Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval_glass_lcd.c"/>
          <file category="source" name="Drivers/BSP/Components/mfxstm32l152/mfxstm32l152.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="IDD"                condition="STM32L476G-EVAL BSP IDD">
        <description>IDD for STMicroelectronics STM32L476G-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval_idd.h"/>
          <file category="source" name="Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval_idd.c"/>
        </files>
      </component>
