armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32L4xx/Keil.STM32L4xx_DFP.pdsc
  <boards>
    <!-- STM32L476G-EVAL Board Support -->
    <board vendor="STMicroelectronics" name="STM32L476G-EVAL" revision="Rev.A" salesContact="http://www.st.com/stonline/contactus/contacts/index.php">
      <description>STMicroelectronics STM32L476G-EVAL</description>
      <image small="MDK/Boards/ST/STM32L476G-EVAL/Documentation/stm32l476g-eval_small.jpg"
             large="MDK/Boards/ST/STM32L476G-EVAL/Documentation/stm32l476g-eval_large.jpg"/>
      <book category="overview"  name="http://www.st.com/web/en/catalog/tools/PF261634" title="Web Page"/>
      <book category="schematic" name="MDK/Boards/ST/STM32L476G-EVAL/Documentation/MB1144B.pdf" title="Schematics"/>
      <book category="manual"    name="MDK/Boards/ST/STM32L476G-EVAL/Documentation/DM00155732.pdf" title="User Manual"/>
      <mountedDevice    deviceIndex="0" Dvendor="STMicroelectronics:13" Dname="STM32L476ZG"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32L476"/>
      <feature type="XTAL"            n="8000000"/>
      <feature type="PWR"             n="5"              name="USB Powered"/>
      <feature type="USB"             n="1"              name="USB 2.0 Full Speed"/>
      <feature type="CAN"             n="1"/>
      <feature type="RS232"           n="1"/>
      <feature type="GLCD"            n="1"  m="240.320" name="2.4 inch Color QVGA TFT LCD with resistive touchscreen"/>
      <feature type="Joystick"        n="1"              name="5-position Joystick"/>
      <feature type="Poti"            n="1"              name="Analog Voltage Control for ADC Input (potentiometer)"/>
      <feature type="Button"          n="4"              name="Push-Buttons for Reset, Tamper and User"/>
      <feature type="LED"             n="4"              name="LEDs directly connected to port pins"/>
      <debugInterface adapter="JTAG/SW" connector="20 pin JTAG (0.1 inch connector)"/>
      <debugInterface adapter="JTAG/SW" connector="20-pin Cortex debug + ETM Trace (0.05 inch connector)"/>
    </board>

    <!-- STM32L496G-Discovery Board Support -->
    <board vendor="STMicroelectronics" name="STM32L496G-Discovery" revision="Rev.1" salesContact="http://www.st.com/stonline/contactus/contacts/index.php">
      <description>STMicroelectronics STM32L496G-Discovery Board Support and Examples</description>
      <image small="MDK/Boards/ST/STM32L496G-DISCO/Documentation/stm32l496g_disco_small.jpg"
             large="MDK/Boards/ST/STM32L496G-DISCO/Documentation/stm32l496g_disco_large.jpg"/>
      <book category="overview"  name="http://www.st.com/en/evaluation-tools/32l496gdiscovery.html" title="STM32L496G-Discovery Web Page"/>
      <book category="setup"     name="MDK/Boards/ST/STM32L496G-DISCO/Documentation/DM00285842.pdf" title="Getting Started"/>
      <!--book category="schematic" name="MDK/Boards/ST/STM32L496G-DISCO/Documentation/stm32l496g-disco_sch.zip" title="Schematics"/-->
      <book category="manual"    name="MDK/Boards/ST/STM32L496G-DISCO/Documentation/DM00353127.pdf" title="User Manual"/>
      <book category="other"     name="MDK/Boards/ST/STM32L496G-DISCO/Documentation/stm32l496g-disco_gerber.zip" title="Gerber Files"/>
      <book category="other"     name="MDK/Boards/ST/STM32L496G-DISCO/Documentation/stm32l496g-disco_bom.zip" title="Bill of Materials"/>
      <mountedDevice    deviceIndex="0" Dvendor="STMicroelectronics:13" Dname="STM32L496AGIx"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32L496"/>
      <feature type="ODbg"      n="1"                name="On-board ST-LINK/V2"/>
      <feature type="ROM"       n="1"                name="64-Mbit Quad-SPI Flash memory"/>
      <feature type="MemCard"   n="1"                name="microSD card holder"/>
      <feature type="PWR"       n="5"                name="USB Powered"/>
      <feature type="PWR"       n="3"  m="5"         name="External Supply"/>
      <feature type="USB"       n="1"                name="USB OTG FS with Micro-AB connector"/>
      <feature type="CAN"       n="1"/>
      <feature type="GLCD"            n="1"  m="240.240" name="2.154 inch TFT color LCD with capacative touch panel"/>
      <feature type="I2C"       n="1"                name="I2C extension connector"/>
      <feature type="Button"    n="1"                name="Reset push button "/>
      <feature type="Joystick"  n="1"                name="4 direction-joystick with selection"/>
      <feature type="LED"       n="8"                name="2 User LEDs"/>
      <debugInterface adapter="ST-Link" connector="Mini-USB"/>
    </board>

    <!-- STM32L4R9I-EVAL Board Support -->
    <board vendor="STMicroelectronics" name="STM32L4R9I-EVAL" revision="Rev.B" salesContact="http://www.st.com/stonline/contactus/contacts/index.php">
      <description>STMicroelectronics STM32L4R9I-EVAL</description>
      <!--image small="MDK/Boards/ST/STM32L4R9I-EVAL/Documentation/stm32l4r9i-eval_small.jpg"
             large="MDK/Boards/ST/STM32L4R9I-EVAL/Documentation/stm32l4r9i-eval_large.jpg"/-->
      <!--book category="overview"  name="http://www.st.com/web/en/catalog/tools/PF261634" title="Web Page"/-->
      <!--book category="manual"    name="MDK/Boards/ST/STM32L4R9I-EVAL/Documentation/?.pdf" title="User Manual"/-->
      <book category="other"     name="MDK/Boards/ST/STM32L4R9I-EVAL/Documentation/stm32l4r9i-eval_gerber.zip" title="Gerber Files"/>
      <mountedDevice    deviceIndex="0" Dvendor="STMicroelectronics:13" Dname="STM32L4R9AIIx"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32L4R9"/>
      <!--
      <feature type="XTAL"            n="8000000"/>
      <feature type="PWR"             n="5"              name="USB Powered"/>
      <feature type="USB"             n="1"              name="USB 2.0 Full Speed"/>
      <feature type="CAN"             n="1"/>
      <feature type="RS232"           n="1"/>
      <feature type="GLCD"            n="1"  m="240.320" name="2.4 inch Color QVGA TFT LCD with resistive touchscreen"/>
      <feature type="Joystick"        n="1"              name="5-position Joystick"/>
      <feature type="Poti"            n="1"              name="Analog Voltage Control for ADC Input (potentiometer)"/>
      <feature type="Button"          n="4"              name="Push-Buttons for Reset, Tamper and User"/>
      <feature type="LED"             n="4"              name="LEDs directly connected to port pins"/>
-->
      <debugInterface adapter="JTAG/SW" connector="20 pin JTAG (0.1 inch connector)"/>
      <debugInterface adapter="JTAG/SW" connector="20-pin Cortex debug + ETM Trace (0.05 inch connector)"/>
      <debugInterface adapter="ST-Link" connector="Mini-USB"/>
    </board>

    <!-- B-L475E-IOT01 Board Support -->
    <board vendor="STMicroelectronics" name="B-L475E-IOT01A1" revision="1" salesContact="http://www.st.com/stonline/contactus/contacts/index.php">
      <description>STMicroelectronics B-L475E-IOT01A1</description>
      <image small="MDK/Boards/ST/B-L475E-IOT01/Documentation/b-l475e-iot01ax-medium.jpg"
             large="MDK/Boards/ST/B-L475E-IOT01/Documentation/b-l475e-iot01ax-large.jpg"/>
      <book category="overview"  name="https://www.st.com/content/st_com/en/products/evaluation-tools/product-evaluation-tools/mcu-mpu-eval-tools/stm32-mcu-mpu-eval-tools/stm32-discovery-kits/b-l475e-iot01a.html" title="Web Page"/>
      <book category="schematic" name="MDK/Boards/ST/B-L475E-IOT01/Documentation/b-l475e-iot01a1_sch_revC.pdf"    title="Schematics revC"/>
      <book category="schematic" name="MDK/Boards/ST/B-L475E-IOT01/Documentation/b-l475e-iot01a1_sch_revD-01.pdf" title="Schematics revD-01"/>
      <book category="manual"    name="MDK/Boards/ST/B-L475E-IOT01/Documentation/b-l475e-iot01a.pdf"              title="Databrief"/>
      <book category="manual"    name="MDK/Boards/ST/B-L475E-IOT01/Documentation/en.DM00347848.pdf"               title="User Manual"/>
      <mountedDevice    deviceIndex="0" Dvendor="STMicroelectronics:13" Dname="STM32L475VG"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32L475"/>
      <feature type="XTAL"          n="32768"/>
      <feature type="ODbg"          n="1"                name="On-board ST-LINK/V2-1"/>
      <feature type="ROM"           n="1"                name="64-Mbit Quad-SPI Flash memory"/>
      <feature type="PWR"           n="5"                name="USB Powered"/>
      <feature type="USB"           n="1"                name="USB OTG FS with Micro-AB connector"/>
      <feature type="Other"         n="1"                name="Bluetooth v4.1 module"/>
      <feature type="Other"         n="1"                name="Sub-GHz low-power RF module"/>
      <feature type="Other"         n="1"                name="802.11 b/g/n compliant WiFi module"/>
      <feature type="Other"         n="1"                name="Dynamic NFC tag based on M24SR"/>
      <feature type="SensOther"     n="1"                name="3-axis Magnetometer"/>
	    <feature type="SensOther"     n="1"                name="260-1260 hPa absolute digital output Barometer"/>
	    <feature type="SensOther"     n="1"                name="Time-of-Flight and Gesture-detection sensor"/>
      <feature type="MIC"           n="2"                name="Digital omnidirectional Microphone"/>
      <feature type="TempSens"      n="1"/>
      <feature type="Accelerometer" n="1"                name="3D Accelerometer and 3D Gyroscope"/>
      <feature type="Button"        n="2"                name="Push-Buttons for Reset and User"/>
      <feature type="LED"           n="2"                name="2 User LEDs"/>
      <feature type="ArduinoFF"     n="1"/>
      <debugInterface adapter="ST-Link" connector="Micro-USB"/>
      <debugInterface adapter="SW"      connector="10 pin TAG"/>
    </board>
  </boards>

  <examples>
    <!-- STM32L476G-EVAL Board -->
    <example name="CMSIS-RTOS2 Blinky" doc="Abstract.txt" folder="MDK/Boards/ST/STM32L476G-EVAL/Blinky">
      <description>CMSIS-RTOS2 Blinky example</description>
      <board name="STM32L476G-EVAL" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
    
    <example name="CMSIS-RTOS2 Blinky Low Power" doc="Abstract.txt" folder="MDK/Boards/ST/STM32L476G-EVAL/Blinky_LP">
      <description>CMSIS-RTOS2 Blinky Low Power example</description>
      <board name="STM32L476G-EVAL" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <!-- STM32L496G-Discovery Board -->
    <example name="CMSIS-RTOS2 Blinky" doc="Abstract.txt" folder="MDK/Boards/ST/STM32L496G-DISCO/Blinky">
      <description>CMSIS-RTOS2 Blinky example</description>
      <board name="STM32L496G-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

